Revit 2027 API
MetalFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "MetalFinish" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MetalFinishType
Public Enumeration MetalFinishType
public enum class MetalFinishType
type MetalFinishType
Members
Member name | Value | Description
Brushed | 3
Polished | 0
Satin | 2
SemiPolished | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace